---
type: TextRange
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# TextRange

`Autodesk.Revit.DB.TextRange` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TextRange | — | `` |
| Constructor | TextRange | 2017 | `public TextRange ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | End | 2017 | `public int End { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Length | 2017 | `public int Length { get ; set ; }` |
| Property | Start | 2017 | `public int Start { get ; set ; }` |